backend/api/app/controllers/api/countries_controller.rb

    def index
      @countries = Country.all
---
SELECT `countries`.* FROM `countries`

    def show
      @country = Country.find(params[:id])
---
SELECT  `countries`.* FROM `countries` WHERE `countries`.`id` = 2 LIMIT 1