backend/api/app/controllers/api/events_controller.rb

    def index
      @events = Event.all
---
SELECT `events`.* FROM `events`

    def show
      @event = Event.find_by(id: params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1