backend/api/app/controllers/api/players_controller.rb

SELECT  `players`.* FROM `players` WHERE `players`.`id` = 2 LIMIT 1
---
    def show
      @player = Player.find(params[:id])