backend/api/app/controllers/api/user_schedules_controller.rb

    def create
      if user_schedule_params[:id].nil?
        @user_schedule = UserSchedule.new(user_schedule_params)
        if @user_schedule.save
          render json: @user_schedule
        else
          render json: "create failed"
        end
      else
        @user_schedule = UserSchedule.find(params[:id])
---
SELECT  `user_schedules`.* FROM `user_schedules` WHERE (11) LIMIT 1