backend/api/app/controllers/api/user_schedules_controller.rb

    def like
      @user_schedule = UserSchedule.find_by(id: like_params[:id])
      if @user_schedule.nil?
        render json: "Couldn't find UserSchedule with 'id'"
      else
        if @user_schedule.increment!(:like)
---
SELECT  `user_schedules`.* FROM `user_schedules` WHERE `user_schedules`.`id` = 19 LIMIT 1
UPDATE `user_schedules` SET `like` = 1 WHERE `user_schedules`.`id` = 15

    def index
      @user_schedules = UserSchedule.all
---
SELECT `user_schedules`.* FROM `user_schedules`

    def create
      if user_schedule_params[:id].nil?
        # new
        @user_schedule = UserSchedule.new(user_schedule_params)
        if @user_schedule.save
          render json: @user_schedule
        else
          render json: "create failed"
        end
      else
        # update
        @user_schedule = UserSchedule.find_by(id: params[:id])
        if @user_schedule.nil?
          render json: "Couldn't find UserSchedule with 'id'"
        else
          if @user_schedule.update(user_schedule_params)
---
INSERT INTO `user_schedules` (`userID`, `detail`) VALUES (1, 'dfsadfa')
SELECT  `user_schedules`.* FROM `user_schedules` WHERE `user_schedules`.`id` = 4 LIMIT 1
UPDATE `user_schedules` SET `id` = 20, `userID` = 2, `detail` = 'dfgasgdsahashasgsdagsahash' WHERE `user_schedules`.`id` = 15

    def show
      @user_schedule = UserSchedule.find(params[:id])
---
SELECT  `user_schedules`.* FROM `user_schedules` WHERE `user_schedules`.`id` = 2 LIMIT 1

    def destroy
      @user_schedule = UserSchedule.find_by(id: params[:id])
      if @user_schedule.nil?
        render json: "Couldn't find UserSchedule with 'id'"
      else
        @user_schedule.destroy
---
SELECT  `user_schedules`.* FROM `user_schedules` WHERE `user_schedules`.`id` = 2 LIMIT 1
DELETE FROM `user_schedules` WHERE `user_schedules`.`id` = 1