backend/api/app/controllers/api/users_controller.rb

    def create
      # new
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`name`, `photo`) VALUES ('morishita', x'686f67652e6a7067')

    def show
      @user = User.find_by(id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

    def new
      @user = User.new(name: "hoge", photo: "hoge.jpg")
      if @user.save
---
INSERT INTO `users` (`name`, `photo`) VALUES ('hoge', x'686f67652e6a7067')